# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\aixt\ports\Cypress\CY8CKIT-049-42XX\examples\Config_Gral_049.cydsn\CE230991_My_First_Project01.cydsn\CE230991_My_First_Project01.cyprj
# Date: Thu, 15 May 2025 00:34:18 GMT
#set_units -time ns
create_clock -name {Clock_1(FFB)} -period 1250000 -waveform {0 625000} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 30001 60001} [list]


# Component constraints for C:\aixt\ports\Cypress\CY8CKIT-049-42XX\examples\Config_Gral_049.cydsn\CE230991_My_First_Project01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\aixt\ports\Cypress\CY8CKIT-049-42XX\examples\Config_Gral_049.cydsn\CE230991_My_First_Project01.cydsn\CE230991_My_First_Project01.cyprj
# Date: Thu, 15 May 2025 00:34:16 GMT
